using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp
{
    internal class Program
    {
        static void Main(string[] args)
        {
        }
        //Меню
        //{
        //регистрация
        //войти в аккаунт
        ///каталог товаров
        //}

        //Проверка
        //{
        //если пользователь вошел, то показываем корзину
        //}

        static void registration()
        {
        }
        //Регистрация 
        //{
        ////Создать экземпляр класса пользователя из БД
        ///Попросить пользователя заполнить экземпляр данными
        ///Проверить не занят ли логин(почта/телефон) введённый пользователем пользователя
        /////пользователь вводит повторно пароль
        ///Если все прошло успешно добавить пользователя и войти в аккаунт\вернутся в меню
        //}

        //Войти в аккаунт
        //{
        //пользователь вводит логин
        //пользователь вводит пароль 7
        //проверяем есть ли такой лог в базе данных
        //если есть то проверяем правильный ли пароль, а если нет то выводим ошибку
        //если все успешно то входим в акк
        //}

        //каталог товаров 
        //{
        //вывести данные из таблице товров бд
        //выбрать конкретный товар(айди)
        //очищение консоли
        //выводим полную информацию о товаре
        //выбор между добавлением в корзину и вернуться в меню и купить товар
        //}

        //функция для добавления товара в коризу(Товары товар)

        //фунция для оформления заказа
    }
}
